# users = {'name':'马汉','sex':'男','high':'180cm','weight':'80kg'};
# print(users['name'] + users['high'])
# # 将location加入到users字典中
# users['location'] = '咸阳';
# print(users)
# # 遍历users字典列表，items() 方法把字典中每对 key 和 value 组成一个元组，并把这些元组放在列表中返回。
# for key,value in users.items():
#     print(key + ": " + value)

# ************************************************************************************************************************************************************

# # 网站用户，VIP级别分别为level1 ,lever2,VIP
# # 网站用户信息用字典存储，信息结构如下：姓名，性别，
# # 年龄，身高，体重，级别，根据网站用户级别判断，
# # 1级在618大促中赠送50元代金卷，2级赠送100元，
# # VIP赠送200元!请大家判断用户级别，编写一个应用场景！

# users = {'name':'马汉','sex':'男','high':'180cm','weight':'80kg','age':'45','class':'lever2','voucher':'0'};
# if users['class'] == 'lever1':
#     voucher = 50;
# elif users['class'] == 'lever2':
#     voucher = 100;
# elif users['class'] == 'VIP':
#     voucher = 200;
# # 需要将voucher转化为string类型再做计算
# users['voucher'] = str(voucher); 
# print("本次618大促活动赠送您" + users['voucher'] + "元代金券")

# ***********************************************************************************************************************************************************

# 创建一个名为User的字典，将其中5个城市的名字作为“键”，
# 对于每个城市再创建一个字典，其中包含该城市所属的国家，
# 人口数，建城时间，特产， 面积等信息，
# 并用遍历的方法输出每所城市的详细信息。

# 字典中嵌套字典再嵌套列表
user = {
    '北京':{
        '国家':'中国', 
        '人口':'2153.6万人', 
        '建城时间':'北京城区 肇始斯地 其时惟周 其名曰蓟',
        '面积':'1.641万平方公里',
        '特产':['稻香村的糕点', '月盛斋的酱肉', '全聚德的烤鸭', '张一元的茶叶', '六必居的咸菜', '......'],
    },

    '上海':{
        '国家':'中国', 
        '人口':'2428.14万人', 
        '建城时间':'公元1292年',
        '面积':'6340平方公里',
        '特产':['梨膏糖', '五香豆', '南翔小笼', '七宝方糕', '高桥饼', '......'],
    },

    '南京':{
        '国家':'中国', 
        '人口':'850.0万人', 
        '建城时间':'公元前333年',
        '面积':'6587平方公里',
        '特产':['活珠子', '紫背天葵', '南京云锦', '南京雨花石', '状元豆', '......'],
    },

    '香港':{
        '国家':'中国', 
        '人口':'750.07万人', 
        '建城时间':'1841年',
        '面积':'1106.34平方公里',
        '特产':['杨枝甘露', '冰皮月饼', '芒果班戟', '车仔面', '姜汁撞奶', '......'],
    },

    '澳门':{
        '国家':'中国', 
        '人口':'67.96万人', 
        '建城时间':'1553年',
        '面积':'32平方公里',
        '特产':['葡式蛋挞', '老婆饼', '花生糖', '澳门豆捞', '猪扒包', '......'],
    },
}

# 遍历user字典，返回city、messages键值对
for city, messages in user.items():
    print("\n城市：" + city)
    print("\t国家：" + str(messages['国家']))
    print("\t人口：" + str(messages['人口']))
    print("\t建城时间：" + str(messages['建城时间']))
    print("\t面积：" + str(messages['面积']) + "\n\t特产：")    #\n\t先换行后缩进

    # 遍历messages中的[特产]，返回specialty
    for specialty in messages['特产']:
        print("\t      " + specialty)